[
  "Is there a codification on choice of law or are there similar established rules?",
    "Are these rules part of a private international law instrument?",
    "Are these rules a consequence of a recent law reform?",
    "If a codification of private international law (PIL) exists, is any revision of these rules under discussion?",
    "Could the HCCH Principles be expected to play a model role in the revision of the PIL rules?",
    "Could the HCCH Principles be expected to play any role in interpreting the existing PIL rules?",
    "Could the HCCH Principles be expected to play any role in supplementing the existing PIL rules?",
    "Could the HCCH Principles be expected to play any role in developing the existing PIL rules?",
    "Do the courts have the authority to refer to the HCCH Principles as persuasive authority?",
    "Is the principle of party autonomy in respect of choice of law in international commercial contracts widely accepted in this jurisdiction?",
    "Are the parties to an international commercial contract thus allowed to choose the law applicable to their contract?",
    "Are the parties allowed to choose different laws for different parts or aspects of the contract? ",
    "Are the parties allowed to choose the applicable law with respect to only one part or aspect of their contract?",
    "Are the parties allowed to make or modify a choice of law at any time?",
    "May an internal modification of the agreement on the applicable law after the conclusion of the contract be valid even if a specific form is requested for the original choice?",
    "May a choice of law or modification made after the conclusion of the contract have an impact on the rights of third parties?",
    "Is a connection required between the chosen law and the parties or their transaction? ",
    "Are the parties prevented from choosing the law of a third country with which there is no connection (a “neutral law”)?",
    "Are there any cases in which an agreement by the parties on the applicable law was not respected for lack of such a connection?",
    "Are the parties allowed to choose non-State law (“rules of law”) to govern their contract?",
    "Are there any particular requirements or restrictions with regard to the eligible rules of law?",
    "Are the parties allowed to incorporate rules of law into their contract by way of reference? ",
    "Are there any requirements for the effective incorporation of rules of law into the contract?",
    "Does this jurisdiction require a choice of law to be made expressly?",
    "Can a choice of law be made tacitly?",
    "Is tacit choice of law clearly distinguished from the position where there is no choice of law?",
    "Are clear criteria employed to examine whether there is a tacit choice of law?",
    "May a tacit choice of law be deduced from the provisions of the contract?",
    "May a tacit choice of law be deduced from the reference to legal provisions?",
    "May a tacit choice of law be deduced from the reference to institutions of a particular jurisdiction?",
    "May a tacit choice of law be deduced from the surrounding circumstances?",
    "May a tacit choice of law be deduced from other criteria?",
    "Does a choice of court or arbitral tribunal automatically indicate a tacit choice of law? ",
    "May a choice of court or arbitral tribunal be taken into account as one of the relevant factors in this regard?",
    "May the parties choose non-State law tacitly?",
    "Do the courts in this jurisdiction readily admit the existence of a tacit choice of law?",
    "Do legal authorities (doctrine) consider the existence of tacit agreements?",
    "Is there a definition of “overriding mandatory provision” or a similar concept (for instance, a rule of direct or immediate application; an internationally mandatory rule)?",
    "Do the courts apply overriding mandatory provisions of the law of the forum under certain circumstances? ",
    "If the courts sometimes apply overriding mandatory provisions of the law of the forum, under which circumstances will this be the case?",
    "Do the courts apply overriding mandatory provisions of other jurisdictions?",
    "Do the courts take into account overriding mandatory provisions of other jurisdictions?",
    "Is there a definition for “public policy”? ",
    "Is there a particular notion or understanding of public policy with regard to the field of commercial law?",
    "Do the courts exclude the application of a provision of the law chosen by the parties if (the result of) such application would be manifestly incompatible with the public policy of the forum?",
    "Do the courts apply or take into account the public policy of a State whose law would be applicable in the absence of a choice of law?",
    "Do arbitral tribunals have the authority to apply the HCCH Principles?",
    "Do arbitral tribunals apply or take into account overriding mandatory provisions or the public policy of a law other than the law chosen by the parties? ",
    "Does the codification on arbitration, if any, include conflict of laws rules?",
    "Is any revision of the lex arbitri under discussion?",
    "Is there a legal framework to tackle the issue of absence of choice?",
    "Do clear connecting factors exist?",
    "Which are the most common connecting factors?",
    "What is the most frequently used connecting factor?",
    "Is the most frequently used connecting factor suitable to be considered a general default rule?",
    "Are there any arbitral award dealing with the determination of the applicable law?",
    "Is a future version of the HCCH Principles covering the law applicable in the absence of a choice of law by the parties desirable?",
    "Is further guidance on applicable law in international contracts providing protection to weaker parties necessary?",
    "Are there other topics that should be considered for further guidance or revision of the HCCH Principles?",
    "Should the HCCH Principles be incorporated into a new HCCH instrument?"
  ]